# End Treatment Type Create Method

Source: https://www.revitapidocs.com/2026/bfa0b5ed-b4e3-dcba-67f9-7ea73bf408b2.htm

---

| End Treatment Type Create Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document) | Creates a new EndTreatmentType in the specified document. |
|  | Create(Document, String) | Creates a new EndTreatmentType in the specified document and adds the input string to the endTreatment parameter. |

Top See Also

#### Reference

EndTreatmentType Class Autodesk.Revit.DB.Structure Namespace